// --- 1
/*
let a = 45
let b = a

b++

console.log('a: ', a)
console.log('b ', b )

// a:  45
// b  46
// b - скопіювали безпосередньо дані a - як примітив, та почали працювати ізольовано

*/

// -- 2
/*
let a = [1,2,3,4,5 ]
let b = a;

b.push(6)

console.log('a: ', a)
console.log('b: ', b )

console.log(a===b)   // true   - це однакові масиви
*/
// a- непримітив, тобто b - не копіює , а посилається на - а, вносить такоє зміни у його значення; у обох цих змінних зберігаються однакові значенння


// --- 3

// щоб не вносити зміни до першої змінної, необхідно склонувати першу змінну за допомогою concat(), який повертає Копію масива, а не копію посилання
/*
let a = [1,2,3]
let b = a.concat()
b.push(4)


console.log('a:', a)
console.log('b:', b)

console.log(a===b)   // false   - це вже різні масиви

// a: [ 1, 2, 3 ]
// b: [ 1, 2, 3, 4 ]

*/











































